# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarFreeFormAccessor..::..Dispose Method
RebarFreeFormAccessor Class See Also
---
Releases all resources used by the RebarFreeFormAccessor
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace